ws-client-tests/src/main/java/pt/ipg/mcm/client/cliente.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is Metro/2.3.1-b419 (branches/2.3.1.x-7937; 2014-08-04T08:11:03+0000) JAXWS-RI/2.2.10-b140803.1500 JAXWS-API/2.2.11 JAXB-RI/2.2.10-b140802.1033 JAXB-API/2.2.12-b140109.1041 svn-revision#unknown. --><!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is Metro/2.3.1-b419 (branches/2.3.1.x-7937; 2014-08-04T08:11:03+0000) JAXWS-RI/2.2.10-b140803.1500 JAXWS-API/2.2.11 JAXB-RI/2.2.10-b140802.1033 JAXB-API/2.2.12-b140109.1041 svn-revision#unknown. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://services.mcm.ipg.pt/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://services.mcm.ipg.pt/" name="cliente">
<types>
<xsd:schema>
<xsd:import namespace="http://services.mcm.ipg.pt/" schemaLocation="http://notebook-de-francisco.local:8080/services/cliente?xsd=1"/>
</xsd:schema>
</types>
<message name="get-cliente">
<part name="parameters" element="tns:get-cliente"/>
</message>
<message name="get-clienteResponse">
<part name="parameters" element="tns:get"/>
</message>
<message name="add-cliente">
<part name="parameters" element="tns:add-cliente"/>
</message>
<message name="add-clienteResponse">
<part name="parameters" element="tns:add"/>
</message>
<portType name="ClienteService">
<operation name="get-cliente">
<input wsam:Action="http://services.mcm.ipg.pt/ClienteService/get-clienteRequest" message="tns:get-cliente"/>
<output wsam:Action="http://services.mcm.ipg.pt/ClienteService/get-clienteResponse" message="tns:get-clienteResponse"/>
</operation>
<operation name="add-cliente">
<input wsam:Action="http://services.mcm.ipg.pt/ClienteService/add-clienteRequest" message="tns:add-cliente"/>
<output wsam:Action="http://services.mcm.ipg.pt/ClienteService/add-clienteResponse" message="tns:add-clienteResponse"/>
</operation>
</portType>
<binding name="clientePortBinding" type="tns:ClienteService">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
<operation name="get-cliente">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="add-cliente">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
</binding>
<service name="cliente">
<port name="clientePort" binding="tns:clientePortBinding">
<soap:address location="http://notebook-de-francisco.local:8080/services/cliente"/>
</port>
</service>
</definitions>