ws-client-tests/src/test/resources/soap-messages/res1.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Header/>
    <S:Body><ns2:get xmlns:ns2="http://services.mcm.ipg.pt/">
            <response>
                <contribuinte>111</contribuinte>
                <nome>usercliente</nome>
                <role>1</role>
                <morada>ria do cliente</morada>
                <porta>0</porta>
                <localidade>0</localidade>
            </response>
        </ns2:get></S:Body>
</S:Envelope>