rest-client/src/test/resources/soap-messages/req1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://services.mcm.ipg.pt/">
    <soapenv:Header/>
    <soapenv:Body>
        <ser:get-cliente>
            <!--Optional:-->
            <request>
                <id>1</id>
            </request>
        </ser:get-cliente>
    </soapenv:Body>
</soapenv:Envelope>